RIET/src/Catalogs/LegalEntities/LegalEntities.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>LegalEntities</name>
  <predefined>
    <items>
      <name>OIES</name>
      <description>OILFIELD INTERNATIONAL EQUIPMENT &amp; SUPPLIES INC. (OP0114)</description>
    </items>
    <items>
      <name>PES_FZE</name>
      <description>PETROLEUM EQUIPMENT AND SUPPLIES (OP0399)</description>
    </items>
    <items>
      <name>STC</name>
      <description>SCHLUMBERGER TECHNOLOGY CORPORATION (OP0001)</description>
    </items>
    <items>
      <name>SRP_FZE</name>
      <description>SLB RESERVOIR PRODUCTION FZE (OP0311)</description>
    </items>
  </predefined>
  <attributes>
    <name>SoldToAddress</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>InTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CountryCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ERPID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FinanceLocCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FinanceProcess</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ParentCompany</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>ReplaceWIth</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>NameRus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SoldToAddressRus</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CostCenter</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодКлассификатора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RechargeToLegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>RechargeToAU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>RechargeToActivity</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/LegalEntities/ManagerModule.bsl
Функция ПолучитьПоРеквизитамTMS(CompanyCode, CountryCode, ERPID, FinanceLocCode, FinanceProcess) Экспорт
	
	Если НЕ ЗначениеЗаполнено(CompanyCode)
		ИЛИ НЕ ЗначениеЗаполнено(CountryCode)
		ИЛИ НЕ ЗначениеЗаполнено(ERPID)
		ИЛИ НЕ ЗначениеЗаполнено(FinanceLocCode)
		ИЛИ НЕ ЗначениеЗаполнено(FinanceProcess) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("CompanyCode", CompanyCode);
	Запрос.УстановитьПараметр("CountryCode", CountryCode);
	Запрос.УстановитьПараметр("ERPID", ERPID);
	Запрос.УстановитьПараметр("FinanceLocCode", FinanceLocCode);
	Запрос.УстановитьПараметр("FinanceProcess", FinanceProcess);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	LegalEntities.Ссылка
		|ИЗ
		|	Справочник.LegalEntities КАК LegalEntities
		|ГДЕ
		|	LegalEntities.CompanyCode = &CompanyCode
		|	И LegalEntities.CountryCode = &CountryCode
		|	И LegalEntities.ERPID = &ERPID
		|	И LegalEntities.FinanceLocCode = &FinanceLocCode
		|	И LegalEntities.FinanceProcess = &FinanceProcess
		|	И LegalEntities.InTMS
		|	И НЕ LegalEntities.ПометкаУдаления";
		
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() > 1 Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS() Тогда 
		СтандартнаяОбработка = Ложь;
		Поля.Добавить("NameRus");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS() Тогда 
		СтандартнаяОбработка = Ложь;
	  	Представление = Данные.NameRus;
	КонецЕсли;
	 	       
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если РГСофтСерверПовтИспСеанс.ПолучитьПараметрСеансаShowNamesAndDescriptionsRUS() 
		И ЗначениеЗаполнено(Параметры.СтрокаПоиска) Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("NameRus", Параметры.СтрокаПоиска + "%");
		
		Запрос.Текст = "ВЫБРАТЬ
		|	LegalEntities.Ссылка
		|ИЗ
		|	Справочник.LegalEntities КАК LegalEntities
		|ГДЕ
		|	LegalEntities.NameRus ПОДОБНО &NameRus
		|	И НЕ LegalEntities.ПометкаУдаления";
		           		
		Если Параметры.Отбор.Свойство("ParentCompany") Тогда
			Запрос.Текст = Запрос.Текст + "
				|И LegalEntities.ParentCompany = &ParentCompany";
			Запрос.УстановитьПараметр("ParentCompany", Параметры.Отбор.ParentCompany);
		КонецЕсли;
		
		ТаблицаРезультатов = Запрос.Выполнить().Выгрузить();
		МассивСсылок = ТаблицаРезультатов.ВыгрузитьКолонку("Ссылка");
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.ЗагрузитьЗначения(МассивСсылок);
		
	КонецЕсли;
	
КонецПроцедуры
